Revit 2027 API
EffectInstance.SetDiffuseColor Method
 Sets the diffuse color parameter of the effect instance.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetDiffuseColor(
	Color color
)
Public Sub SetDiffuseColor (
	color As Color
)
public:
void SetDiffuseColor(
	Color^ color
)
member SetDiffuseColor :
        color : Color -> unit
Parameters
color Color
 The diffuse color value.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
EffectInstance Class
Autodesk.Revit.DB.DirectContext3D Namespace